In [1]:
import pandas as pd
import numpy as np

In this notebook, we create a simple dataset containing city names and their populations. The `City` column currently stores full city names. 

Our objective is to transform these categorical values into standardized city codes 
(e.g., Istanbul â†’ IST) using a mapping approach.

In [2]:
df = pd.DataFrame({'City': ['Istanbul', 'Ankara', 'Izmir', 'Bursa', 'Antalya'],
                   'Population': [15519267, 5639076, 4470587, 3101833, 2619832]})

df

       City  Population
0  Istanbul    15519267
1    Ankara     5639076
2     Izmir     4470587
3     Bursa     3101833
4   Antalya     2619832

Let's create a mapping dictionary for each city name and apply it to the dataset.

In [3]:
city_mapping = {'Istanbul': 'IST',
                'Ankara': 'ANK',
                'Izmir': 'IZM',
                'Bursa': 'BUR',
                'Antalya': 'ANT'}

df['City'] = df['City'].map(city_mapping)

df

  City  Population
0  IST    15519267
1  ANK     5639076
2  IZM     4470587
3  BUR     3101833
4  ANT     2619832